[
  {
    "name": "",
    "link": "",
    "period": "",
    "descriptions": [[""]],
    "desc_links": {},
    "tech": "",
    "images": []
  },
  {
    "name": "Distributed Systems",
    "link": "",
    "period": "June 2023 - July 2023",
    "descriptions": [
      [
        "A University project about manage independent robots of a city using distributed algorithms and communication technologies for sensor data streaming."
      ]
    ],
    "desc_links": {},
    "tech": "Java, Google Protocol Buffers, gRPC, MQTT, Jersey JAXB for REST API",
    "images": []
  },
  {
    "name": "Business Process Intelligence",
    "link": "",
    "period": "June 2023 - July 2023",
    "descriptions": [
      [
        "A Univerity project about data mining, process mining, variant analysis, and process discovery using a dataset of several millions of events and cases of a Netherland company."
      ],
      [
        "A Univerity project about Business Process Intelligence Challenge 2019: data mining, process mining, variant analysis, and process discovery using a dataset of several millions of events and cases for a Netherland company. Creating several Petri Nets, BPMN, process tree and Data Visualization for different process categories"
      ]
    ],
    "desc_links": {},
    "tech": "Python, pm4py, seaborn",
    "images": []
  },
  {
    "name": "pyTradingBot",
    "link": "",
    "period": "December 2021 - present",
    "descriptions": [
      [
        "A library of functions to test trading strategies using several Machine Learning and Reinforcement Learning techniques, and Telegram API"
      ],
      [
        "Engineered the infrastucture and the models of a trading copilot, using Machine Learning and Reinforcement Learning. The bot is able to trade on multiple exchanges and is connected to a Telegram bot for notifications and commands."
      ]
    ],
    "desc_links": {},
    "tech": "Python, PyTorch, Keras, stable-baselines, OpenAI Gym, TAlib and others",
    "images": []
  },
  {
    "name": "SWAGVote",
    "link": "",
    "period": "October 2021 - January 2022",
    "descriptions": [
      [
        "A University project about creating a system for online voting: creating, managing and counting electoral votes. Engineering the architecture and reusable software using diagrams like Use Cases, Class Diagram, Sequence Diagram, UML, FSM."
      ]
    ],
    "desc_links": {},
    "tech": "Java, SQLite, Maven, Eclipse, JavaFX",
    "images": []
  }
]
